Revit 2026 API

# DocumentWorksharingCentralGUID Property

---

The central GUID of the server-based model.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Guid WorksharingCentralGUID { get; }
```
```vb
Public ReadOnly Property WorksharingCentralGUID As Guid
	Get
```
```cpp
public:
property Guid WorksharingCentralGUID {
	Guid get ();
}
```
```fsharp
member WorksharingCentralGUID : Guid with get
```

#### Property Value

Guid

| Exception | Condition |
| --- | --- |
| InapplicableDataException | Thrown when the central model of this document is not a server-based model that created in Revit 2013 or later release. |

The central model of this document that is file-based model or saved in a release prior to Revit 2013 did not have this GUID. Only the central model saved in Revit 2013 or later and stored on Revit Server will be able to provide this value.

#### Reference

Document Class

Autodesk.Revit.DB Namespace